data/soap/templates/login.soap.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  SOAP Login Template - Holt Session-Token für ein Institut

  Platzhalter (auto-inject):
    {{institut}}  - Institut-Nummer (bestimmt Routing)
    {{user}}      - Benutzername aus Institut-Config
    {{password}}  - Passwort aus Institut-Config

  Response-Extraktion (konfigurierbar in Service):
    session_token_xpath: //SessionToken/text()
-->
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:auth="http://example.com/auth">
  <soap:Body>
    <auth:Login>
      <auth:InstitutNr>{{institut}}</auth:InstitutNr>
      <auth:Username>{{user}}</auth:Username>
      <auth:Password>{{password}}</auth:Password>
      <auth:ApplicationId>AI-Assist</auth:ApplicationId>
    </auth:Login>
  </soap:Body>
</soap:Envelope>
